"""
Модуль пользовательских исключений для транспортных средств.
"""

class LowFuelError(Exception):
    """Класс исключения для обработки ситуации с низким уровнем топлива.
    Этот класс наследует от встроенного класса Exception и используется для генерации ошибок, связанных с критически низким уровнем топлива.
    
    Аргументы:
        message (str): Сообщение об ошибке, по умолчанию "Уровень топлива критически низок".
    """
    def __init__(self, message="Уровень топлива критически низок"):
        self.message = message
        super().__init__(self.message)


class NotEnoughFuel(Exception):
    """Исключение, возникающее при недостатке топлива для совершения поездки.
    
    Аргументы:
        message (str): Сообщение об ошибке. По умолчанию "Недостаточно топлива для совершения поездки".
    """
    def __init__(self, message="Недостаточно топлива для совершения поездки"):
        self.message = message
        super().__init__(self.message)


class CargoOverload(Exception):
    """Исключение, возникающее при превышении максимальной грузоподъемности.
    
    Аргументы:
        message (str): Сообщение об ошибке. По умолчанию "Превышена максимальная грузоподъемность".
    """
    def __init__(self, message="Превышена максимальная грузоподъемность"):
        self.message = message
        super().__init__(self.message)